app/controllers/questions_controller.rb

SELECT "alternatives".* FROM "alternatives" WHERE "alternatives"."question_id" = $1  [["question_id", 1]]
---
  def edit
    (5 - @question.alternatives.count).times do

INSERT INTO "questions" ("description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "teste"], ["user_id", 1], ["created_at", "2018-05-24 19:59:23.544168"], ["updated_at", "2018-05-24 19:59:23.544168"]]
---
  def create
    @question = Question.new(question_params)
    @question.user = current_user

    respond_to do |format|
      if @question.save

UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["description", "teste2 de enem"], ["updated_at", "2018-06-07 18:35:31.883581"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)